; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.7.0
; Author:	Teijo Sakkara <teijo-at-nettilinja.fi>
; Homepage:
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
1=Tiedosto
2=Asetukset
3=Ohje
4=
5=Valitse tiedosto
6=Purettava paketti tai &asennusohjelma:
7=Purkaa kohteeseen
8=&Kohdekansio:
9=
10=Universal Extractorin asetukset
11=Muista tiedostohistoria
12=
13=
14=&Kieli:
15=
16=
17=Tiedostotyyppikohtaiset lisдasetukset
18=Varoita ennen suoritusta
19=Poista &kaksoiskappaleet
20=Poista &vдliaikaistiedostot
21=&Lisдд puuttuvat tiedostopддtteet
22=
23=
24=%s Kotisivut (www)
25=
26=
27=
28=
29=
30=
31=&OK
32=
33=
34=&Peruuta
35=Asetukset 2
36=%s -paketin purku
37=%s tukee seuraavanlaisia menetelmiд purkaa %s -paketteja. Valitettavasti mikддn menetelmistд ei ole 100% luotettava.  Jollei oletustapa nдytд toimivan, suorita uudestaan %s ja valitse toinen purkumenetelmд.
38=Purkumenetelmд
39=%s Jдrjestelmдnvalvojan asennus
40=%s purkaminen
41=%s valintakytkimellд
42=%s Purkaaja
43=Ei ole InstallShield-asennusohjelma
44=
45=
46=
47=%s Valitse kelvollinen tiedosto.
48=Avaa tiedosto
49=Kirjoita kohteeseen
50=
51=paketti
52=pakattu tiedosto
53=
54=eBook
55=eCard
56=koodattu tiedosto
57=sovellus
58=
59=ohjetiedosto
60=hotfix
61=levykuva
62=asennusohjelma
63=
64=paketti
65=korjauspдivitys
66=itsepurkautuva
67=vaihe
68=
69=testataan
70=
71=
72=pдivitysohjelma
73=
74=
75=Tutkitaan tiedoston tyyppiд...
76=Tutkitaan tiedostoa '%s'.
77=Puretaan kohde:
78=Asennusohjelma kдynnistyy.%nOdota.
79=
80=BIN/CUE CD-ROM-levykuvia ei voi purkaa suoraan. Tдmд levykuva%n muunnetaan ennen purkamista ensin ISO CD-ROM-levykuvaksi.%n%nJatketaanko?%nHuom! Muuntoprosessi voi kestдд useita minuutteja.
81=VIRHE:  BIN/CUE-levykuvaa ei voitu muuntaa.%nVarmista, ettд CUE-tiedoston rakenne on oikeellinen.
82=VIRHE:  ISO-levykuva luotiin BIN/CUE-levykuvasta, mutta sitд ei voitu muuntaa.%nSддstetддnkц ISO-levykuva jatkotutkimuksia varten?
83=VIRHE: Ei lцydy tiedostoja:%n'%s'\'%s.%s'%n%nSekд '%s.bin' ettд '%s.cue' tarvitaan.
84=Alustetaan '%s'.  Sulje asennusohjelma ja paina OK jatkaaksesi.
85=Huom:  Tдmд menetelmд toimii vain tietyillд 'Wise for Windows Installer' -paketeilla.%nIJos 'Wise Installation' -velho kдynnistyy ja odottaa syцtettд, tдtд tiedotomuotoa ei%ntueta.  Sulje asennusohjelma ja %s keskeyttдд purkamisyrityksen.%n%nJatketaanko?
86=Tiedosto on pakattu kдyttдen %s pakkausta, mutta sen purku epдonnistui.%nTдmд voi johtua tukemattomasta tiedostomuodosta tai siitд%nettд pakettitiedostossa ei ole mitддn purettavia tiedostoja.%n%nAvataanko tiedosto purkamisen sijaan?%n%nHuom! Avattu tiedosto nimetддn seuraavasti:%n'%s\'%s_unpacked.%s'
87=VIRHE: %s%nei voida purkaa.
88=VAROITUS:  Tдmдntyyppisten tiedostojen purkamiseksi ne pitдд suorittaa.%nJos jatkat, suoritetaan seuraavanlainen komento:%n%n%s%n%nJos epдilet tiedoston sisдltдvдn haittaohjelmistoja tai viruksia, ei ole suositeltavaa jatkaa.%nJatketaanko?
89=
90=
91=
92=
93=
94='%s' purkamistapahtumia ei voi kirjata lokiin.
95=
96='%s' ei voitu purkaa.%nTiedostotyyppi oli: '%s'%n%nValitse 'OK' jos tahdot itse analysoida tiedostoa. Lopettaaksesi valitse 'Peruuta'.
97=%s%ntiedostolla on tuntematon pддte joten sitд voi purkaa.
98=%s%nei voitu luoda.  Valitse kelvollinen kohdekansio.
99=%s ei voitu purkaa.%nTiedoston tunnistettiin olevan %s. Purkaminen epдonnistui vaikka pakkausmuoto onkin tuettu.%nKatso lisдtietoja lokitiedostosta '%s'.%n%nValitse 'OK' avataksesi lokitiedoston. Lopettaaksesi valitse 'Peruuta'.
100=
101=
102=
103=
104=
105=
106=
107=
108=
109=
110=
111=
112=
113=
114=
115=
116=
117=
118=
119=
